'use strict';

let data = [
    {
        background: 'http://images.9zhitx.com/b3734dfc-6acd-4849-9fc1-1a8901d4efde.jpg',
        color:'#e5b116',
        btnBackground: ['#e5b116', '#daa015'],
        items: [
            {
                txt: '你是一身白衣的宇文门阀宇文玥,是一名谍者领袖，刚刚推门走进房间，就见床上躺着一位美人，你径自走到书桌前坐了下来。美人见状，主动诱之...',
                question: '1.你不动声色，内心挣扎，面对美人的诱惑，你选择？',
                option: ['A、接受诱惑', 'B、拒绝诱惑'],
                deadAnswer: '1',
                deadResult: ['人生处处是陷阱，可惜你在楚乔传里只活到了|1', '你拒绝诱惑准备转身走开，不料美人在背后用暗器刺杀你，导致你受伤，毒性发作而死...', ''],
                show: true,
                index: 0
            },
            {
                txt: '你成功将计就计，引得美人主动出手行刺，一举擒住了她，往围场上奔去成功救下楚乔。',
                question: '2.你在围场救下楚乔，让她成为你的女奴，也逐渐爱上了她，不料楚乔误会你杀了她的家人，你会去跟楚乔解释吗？',
                option: ['A.解释', 'B.不解释'],
                deadAnswer: '0',
                deadResult: ['你的情商真的需要充值了你在楚乔传只能活到|23', '你与楚乔苦口婆心的解释“乔乔人家是爱你的！”楚乔被你的肉麻所恶心，离你而去。', ''],
                show: false,
                index: 1
            },
            {
                txt: '你默默忍受楚乔对你的误会，虽然心里委屈，但是你的性格就是如此，眼睁睁的看着她离你而去',
                question: '3.七年后，你得知楚乔在燕北有危险，明知是圈套，去了会死，你愿意去救楚乔吗？',
                option: ['A.不愿意，只想在家吃辣条', 'B.愿意 '],
                deadAnswer: '0',
                deadResult: ['你在楚乔传活到了|40', '你不去救楚乔，楚乔之后因为太久没见你彻底忘记你，与别人结婚生子咯~你孤独终老吧。', ''],
                show: false,
                index: 2
            },
            {
                txt: '你赶紧跑去救楚乔，虽然还是被燕洵射了两箭快死了，可是俘获了一颗少女心！',
                question: '4.你被月七救下捡回一命，去了青海，爷爷逼你杀了大夏皇帝取而代之，你的选择是？',
                option: ['A.杀！有权力才有一切', 'B.不杀'],
                deadAnswer: '0',
                deadResult: ['每一步的选择都至关重要,离成功只差一步!你活到了|55', '你选择了杀害皇帝，却遭兄弟反目，死于权利搏斗中，害楚乔宝宝天天以泪洗面。', '没有获得成就'],
                winResult: ['恭喜你，双商爆表，顺利活到了大结局！得到了“青海王”最高成就。', '你为了楚乔为了兄弟元彻放弃了权利，带着楚乔回了青海，从此过上了没羞没臊的生活！恭喜你达成宇文玥最高成就！！', '获得了青海王的成就'],
                show: false,
                index: 3
            }
        ]
    },
    {
        background: 'http://images.9zhitx.com/9a4305b7-4ef1-487b-99e3-4be006098dcb.jpg',
        color:'#c9aee1',
        btnBackground: ['#c9aee1', '#a88fbe'],
        items: [
            {
                txt: '摇摇晃晃的囚车上，你正在沉睡。囚车里传来低低的啜泣声，你从梦境里回过神来。醒来后被赶到围场中央，你是女奴，与狼一起被当做猎物供人追杀娱乐，你身边已有好几人倒下',
                question: '1.你虽被燕洵世子救了一次，却难逃再度被两匹饿狼围住的困境，此时你为了求生捡起地上的箭支，将插入狼的哪个部位逃脱困境？（请慎重选择）',
                option: ['A.咽喉', 'B.心脏'],
                deadAnswer: '1',
                deadResult: ['幸运也是实力的一部分，你只能在楚乔传里活到|1', '你选择了插入心脏，不料距离过远，饿狼趁机一口咬住你脑袋，甩飞你，最后失血过多晕在人猎场，被饿狼攻击而死...', ''],
                show: true,
                index: 0
            },
            {
                txt: '你选择了插入咽喉，成功击杀饿狼，逃脱人猎场，随后成为宇文玥的专属女奴，与他相处之中，日久生情，给你的心带来了一片柔软，却不料因一场意外恢复了记忆...',
                question: '2、恢复记忆的你想起你是洛河之女，因与宇文玥原先是敌对关系，误以为宇文玥想杀你们，此时你选择是？',
                option: ['A.留在宇文玥身边等候时机杀他', 'B.离开宇文玥'],
                deadAnswer: '0',
                deadResult: ['后宫小说白看了吧，以你的智商在楚乔传里面只能活到|20', '你选择留在宇文玥身边杀他，在某天端着酒准备下药拿去给宇文玥时，却被宇文席给发现，被宇文席秘密的给处死了', ''],
                show: false,
                index: 1
            },
            {
                txt: '你离开宇文玥和燕洵并肩作战去了燕北，燕北独立后，被封为秀丽将军，开始为自由而战...',
                question: '3.你与燕洵暗生情绪，没想到燕洵为了复仇诛杀了同盟好友和妹妹，你伤心欲绝想离开，燕洵却拿百姓的命威胁你回去，你的选择是？',
                option: ['A.回', 'B.不回'],
                deadAnswer: '0',
                deadResult: ['以你的情商在楚乔传里只能活到|38', '你选择了回去，兵力被没收，因不懂政治被某位早就想铲除你的大臣设计害死。最后成就：燕北秀丽将军！', ''],
                show: false,
                index: 2
            },
            {
                txt: '你被萧策所救，去了卞唐，与宇文玥也冰释前嫌，俩人误会解除，谈起了小恋爱...',
                question: '4、不料萧策被杀，为了保护他四岁的孩子和天下，你有机会成为卞唐皇贵妃把造反一举歼灭，你的选择是？',
                option: ['A.当皇贵妃', 'B.不当皇贵妃'],
                deadAnswer: '0',
                deadResult: ['恭喜你，双商爆表。得到了“卞唐皇贵妃”的成就。活到了|58', '你成功逼退造反派，也当上了皇贵妃，却因为已是萧策女人而与宇文玥天涯两隔，未当成秀丽王...', '获得了卞唐皇贵妃的成就'],
                winResult: ['恭喜你，双商爆表，顺利活到了大结局！得到了“秀丽王”的最高成就。', '你装作同意，在婚礼大殿上击杀了造反派，也表示自己不会当皇贵妃，但是却会保护卞唐江山，被封为秀丽王，从此与宇文玥过上没羞没臊的生活...恭喜你达成楚乔最高成就！！', '获得了秀丽王的成就'],
                show: false,
                index: 3
            }
        ]
    },
    {
        background: 'http://images.9zhitx.com/e26462ab-c633-4acc-af80-0de39543d701.jpg',
        color:'#9fafe6',
        btnBackground: ['#9fafe6', '#8594c7'],
        items: [
            {
                txt: '你是西凉世子，冷静腹黑多疑，心上人是楚乔，虽心怀大志，却总忍不住处处照顾楚乔，救了她许多次，而后你打算带着楚乔回你的国家燕北，却不料遭遇西魏王朝的追杀...',
                question: '1.此时一支冰雪箭从远处射来，你的选择是...（慎重选择）',
                option: ['A.选择躲开', 'B.不躲开'],
                deadAnswer: '0',
                deadResult: ['幸运也是实力的一部分，你只能在楚乔传里活到|24', '你选择躲开，不料因脚崴到，令本该射中肩膀的冰雪箭射中心脏而死。', ''],
                show: true,
                index: 0
            },
            {
                txt: '你被冰雪箭射中肩膀受伤，与楚乔一起被宇文玥关押牢房，见证了家破人亡之后彻底黑化，与楚乔患难见真情，随后二人成功逃脱牢狱。',
                question: '2.你与楚乔逃脱牢狱后，却被囚禁在大夏，皇帝还将自己女儿元淳赐婚给你，你的选择是？',
                option: ['A.娶', 'B.不娶 '],
                deadAnswer: '1',
                deadResult: ['大丈夫要能屈能伸，你在楚乔传只活到了|39', '你因为违抗圣意，而被皇帝下旨斩杀牵连楚乔，含恨而死....', ''],
                show: false,
                index: 1
            },
            {
                txt: '你答应迎娶元淳，却在订婚当天造反，与楚乔一起逃回燕北宣布燕北独立，开始你的复仇之旅...',
                question: '3.你回到燕北后，与楚乔渐生情愫，你被权力诱惑，为了下一步不得不牺牲楚乔，（楚乔会死）你会为了楚乔放弃整个复仇计划吗？',
                option: ['A.不会', 'B.会'],
                deadAnswer: '1',
                deadResult: ['你是个好男人，不过你在楚乔传只能活到|46', '你为了楚乔放弃复仇计划，却因不够狠辣而被其他王朝歼灭了自己的国家。', ''],
                show: false,
                index: 2
            },
            {
                txt: '你不会为了楚乔放弃整个复仇计划，却想了另外一个办法让楚乔成功逃脱，也因为没了羁绊想到了更阴狠的办法...',
                question: '4.你利用楚乔和宇文玥的感情引诱宇文玥上钩杀他，楚乔跪着求你并说“如果你杀了他，我永远不会原谅你。”面对心爱之人，你选择是？',
                option: ['A.杀了宇文玥', 'B.放过宇文玥'],
                deadAnswer: '1',
                deadResult: ['选择决定人生，没有达成燕北王最高成就！你活到了|58', '你选择放过宇文玥，也放弃了复仇，从而与楚乔双宿双飞，两人过上了简单幸福的日子~', '没有获得成就'],
                winResult: ['恭喜你，顺利活到了大结局！得到了“燕北王”的最高成就。', '你杀了宇文玥，楚乔心灰意冷离你而去，你也复仇成功，当上了燕北王，达成最高成就！复仇成功让你感到痛快，而痛快之后内心却充满彷徨和孤单，仿佛失去了对于你最宝贵的东西...', '获得了燕北王的成就'],
                show: false,
                index: 3
            }
        ]
    }
];

export default data;
